Revit 2027 API
ColorWithTransparency(UInt32, UInt32, UInt32, UInt32) Constructor
 color
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ColorWithTransparency(
	uint red,
	uint green,
	uint blue,
	uint transparency
)
Public Sub New (
	red As UInteger,
	green As UInteger,
	blue As UInteger,
	transparency As UInteger
)
public:
ColorWithTransparency(
	unsigned int red,
	unsigned int green,
	unsigned int blue,
	unsigned int transparency
)
new :
        red : uint32 *
        green : uint32 *
        blue : uint32 *
        transparency : uint32 -> ColorWithTransparency
Parameters
red UInt32
 red
green UInt32
 green
blue UInt32
 blue
transparency UInt32
 transparency
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The value is not valid. The valid range is 0 to 255.
See Also
Reference
ColorWithTransparency Class
ColorWithTransparency Overload
Autodesk.Revit.DB Namespace